In [1]:
import pandas as pd

In [2]:
from pandas import DataFrame as df

In [3]:
data={'state':['ohio','ohio','ohio','california','california','california'],
     'year':[2000,2001,2002,2000,2001,2002],
     'pop':[1.2,1.3,1.4,3.5,3.4,3.6]}
frame=df(data)

In [4]:
frame

        state  year  pop
0        ohio  2000  1.2
1        ohio  2001  1.3
2        ohio  2002  1.4
3  california  2000  3.5
4  california  2001  3.4
5  california  2002  3.6

In [5]:
frame2=df(data,columns=['year','pop','state'])
frame2

   year  pop       state
0  2000  1.2        ohio
1  2001  1.3        ohio
2  2002  1.4        ohio
3  2000  3.5  california
4  2001  3.4  california
5  2002  3.6  california

In [6]:
frame2=df(data,columns=['year','pop','state','debt'],index=range(4,10))
frame2

   year  pop       state debt
4  2000  1.2        ohio  NaN
5  2001  1.3        ohio  NaN
6  2002  1.4        ohio  NaN
7  2000  3.5  california  NaN
8  2001  3.4  california  NaN
9  2002  3.6  california  NaN

In [7]:
frame2.state

4          ohio
5          ohio
6          ohio
7    california
8    california
9    california
Name: state, dtype: object

In [8]:
states=frame2.state
states1=(states)
states1

4          ohio
5          ohio
6          ohio
7    california
8    california
9    california
Name: state, dtype: object

In [9]:
frame2.debt=range(4,10)
frame2

   year  pop       state  debt
4  2000  1.2        ohio     4
5  2001  1.3        ohio     5
6  2002  1.4        ohio     6
7  2000  3.5  california     7
8  2001  3.4  california     8
9  2002  3.6  california     9

In [10]:
pop={'nevada':{2001:1.2,2002:1.4},'ohio':{2001:4,2002:5}}
popdf=df(pop)
popdf

      nevada  ohio
2001     1.2     4
2002     1.4     5

In [11]:
popdf.T

        2001  2002
nevada   1.2   1.4
ohio     4.0   5.0

In [12]:
obj=pd.Series(['1','2','3'],index=['one','two','two'])

In [13]:
obj

one    1
two    2
two    3
dtype: object

In [14]:
obj['two']

two    2
two    3
dtype: object

In [15]:
index=obj.index

In [16]:
index

Index(['one', 'two', 'two'], dtype='object')

In [17]:
i=index.unique
i

In [18]:
obj=pd.Series(['a','b','c','d','e'] ,index=[1,7,8,9,2])
obj

1    a
7    b
8    c
9    d
2    e
dtype: object

In [19]:
obj2=obj.reindex([7,8,9,2,1])
obj2

7    b
8    c
9    d
2    e
1    a
dtype: object

In [20]:
obj2=obj.reindex([1,2,7,8,9]).reindex(range(10), method='ffill')
obj2

0    NaN
1      a
2      e
3      e
4      e
5      e
6      e
7      b
8      c
9      d
dtype: object

In [21]:
obj3=obj2.drop([2,3])
obj3

0    NaN
1      a
4      e
5      e
6      e
7      b
8      c
9      d
dtype: object

In [22]:
import numpy as np
obj=pd.DataFrame(np.arange(16).reshape((4,4)) ,index=[1,2,3,4], columns=['a','b','c','d'])
obj

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [23]:
obj1=obj.drop([2,3])
obj1

    a   b   c   d
1   0   1   2   3
4  12  13  14  15

In [24]:
obj

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [25]:
obj1=obj.drop(['b','c'],axis=1)
obj1

    a   d
1   0   3
2   4   7
3   8  11
4  12  15

In [26]:
obj1=obj.drop(['b','c'],axis='columns')
obj1

    a   d
1   0   3
2   4   7
3   8  11
4  12  15

In [27]:
obj1['a']

1     0
2     4
3     8
4    12
Name: a, dtype: int32

In [28]:
obj

    a   b   c   d
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

In [29]:
obj.drop(['b','c'] ,axis=1, inplace=True)
obj

    a   d
1   0   3
2   4   7
3   8  11
4  12  15

In [30]:
obj=pd.Series(range(4),index=['a','b','c','d'])
obj

a    0
b    1
c    2
d    3
dtype: int64

In [31]:
obj[3:]

d    3
dtype: int64

In [32]:
obj[2:3]

c    2
dtype: int64

In [33]:
obj['c':'d']

c    2
d    3
dtype: int64

In [34]:
obj[-1]

3

In [35]:
obj=pd.Series(range(4),index=[6,7,8,9])

In [36]:
obj

6    0
7    1
8    2
9    3
dtype: int64

In [37]:
obj[7]

1

In [38]:
import numpy as np
arr=np.arange(12.).reshape((3,4))
arr[0]

array([0., 1., 2., 3.])

In [39]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [40]:
import pandas as pd
frame=pd.DataFrame(np.arange(12.).reshape(4,3), columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])
series=frame.iloc[0]

In [41]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [42]:
type(series)

pandas.core.series.Series

In [43]:
frame-series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [44]:
series2=pd.Series(range(3),index=list('bef'))
series2

b    0
e    1
f    2
dtype: int64

In [45]:
frame-series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [46]:
frame=pd.DataFrame(np.random.randn(4,3).reshape(4,3), columns=list('bde'),index=['Utah','Ohio','Texas','Oregon'])

In [47]:
frame

               b         d         e
Utah    0.604561  0.331598  0.306799
Ohio   -0.212938 -0.329466 -1.530306
Texas  -0.698240 -0.147923 -0.378296
Oregon -0.486109 -1.154138 -1.292242

In [48]:
frame.abs()

               b         d         e
Utah    0.604561  0.331598  0.306799
Ohio    0.212938  0.329466  1.530306
Texas   0.698240  0.147923  0.378296
Oregon  0.486109  1.154138  1.292242

In [49]:
f=lambda x:x.max()-x.min()
frame.apply(f)

b    1.302801
d    1.485736
e    1.837105
dtype: float64

In [50]:
frame.apply(f,axis='columns')

Utah      0.297762
Ohio      1.317368
Texas     0.550317
Oregon    0.806134
dtype: float64

In [51]:
obj=pd.Series(range(4),index=list('dcba'))
obj

d    0
c    1
b    2
a    3
dtype: int64

In [52]:
obj.sort_index()

a    3
b    2
c    1
d    0
dtype: int64

In [53]:
obj

d    0
c    1
b    2
a    3
dtype: int64

In [54]:
df=pd.DataFrame([[1.4,np.nan],[7.1,-4.5],[np.nan,np.nan],[0.75,-1.3]],index=list('abcd'),columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [55]:
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [56]:
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [57]:
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [58]:
df.max()

one    7.1
two   -1.3
dtype: float64

In [59]:
df.idxmax()

one    b
two    d
dtype: object

In [60]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [1]:
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'